Project/Toir/src/Documents/торо_ОценкаРаботыПодрядчика/торо_ОценкаРаботыПодрядчика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ОценкаРаботыПодрядчика</name>
  <basedOn>Document.торо_АктОВыполненииЭтапаРабот</basedOn>
  <registerRecords>InformationRegister.торо_ОценкиПоПодрядчикам</registerRecords>
  <registerRecords>InformationRegister.торо_ОценкиПодрядчиковПоКритериям</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АктОВыполненииРабот</name>
    <type>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСогласования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапСогласования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаДляВсехРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОценкиПодрядчиков</name>
    <attributes>
      <name>ВидОценки</name>
      <type>
        <types>CatalogRef.торо_ВидыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОценки</name>
    <attributes>
      <name>КритерийОценки</name>
      <type>
        <types>CatalogRef.торо_КритерииОценки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеОценокПоКритериям</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОценки</name>
      <type>
        <types>CatalogRef.торо_ВидыОценок</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_ОценкиПоПодрядчикам/торо_ОценкиПоПодрядчикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОценкиПоПодрядчикам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оценка</name>
    <type>
      <types>CatalogRef.торо_ВидыОценок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РемонтыОборудования_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОценкиПодрядчиковПоКритериям/торо_ОценкиПодрядчиковПоКритериям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОценкиПодрядчиковПоКритериям</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оценка</name>
    <type>
      <types>CatalogRef.торо_КритерииОценки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОценки</name>
    <type>
      <types>CatalogRef.торо_ВидыОценок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РемонтыОборудования_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/торо_ОценкаРаботыПодрядчика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПЕРЕМЕННЫЕ

Перем СтруктураДанных Экспорт; // Структура, хранящая данные для работы с уведомлениями.
Перем БезусловнаяЗапись Экспорт; // Отключает проверки при записи документа.

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.торо_АктОВыполненииЭтапаРабот") Тогда
		Организация         = ДанныеЗаполнения.Организация;
		АктОВыполненииРабот = ДанныеЗаполнения;		
	КонецЕсли;

	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверкаСуществующихОценок(Отказ);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ОценкаДляВсехРабот Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ОбъектыРемонта");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если БезусловнаяЗапись = Истина
		ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Не АктОВыполненииРабот.Проведен Тогда
		ТекстСообщения = НСтр("ru = 'Есть непроведенный документ основание: " + АктОВыполненииРабот + "'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОценкаДляВсехРабот Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОценкаРаботыПодрядчикаОбъектыРемонта.ОбъектРемонта,
		|	торо_ОценкаРаботыПодрядчикаОценкиПодрядчиков.ВидОценки
		|ИЗ
		|	Документ.торо_ОценкаРаботыПодрядчика.ОбъектыРемонта КАК торо_ОценкаРаботыПодрядчикаОбъектыРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ОценкаРаботыПодрядчика.ОценкиПодрядчиков КАК торо_ОценкаРаботыПодрядчикаОценкиПодрядчиков
		|		ПО торо_ОценкаРаботыПодрядчикаОбъектыРемонта.ID = торо_ОценкаРаботыПодрядчикаОценкиПодрядчиков.ID
		|			И торо_ОценкаРаботыПодрядчикаОбъектыРемонта.Ссылка = торо_ОценкаРаботыПодрядчикаОценкиПодрядчиков.Ссылка
		|ГДЕ
		|	торо_ОценкаРаботыПодрядчикаОценкиПодрядчиков.ВидОценки ЕСТЬ NULL 
		|	И торо_ОценкаРаботыПодрядчикаОбъектыРемонта.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ШаблонСообщения = НСтр("es='Para el objeto %1 no es indicada la apreciación';ru='Для объекта %1 не указана оценка';en='No rating for object%1'");
		
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ОбъектРемонта);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЦикла; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОценкаРаботыПодрядчикаОбъектыРемонта.ОбъектРемонта,
		|	торо_ОценкаРаботыПодрядчикаПараметрыОценки.ВидОценки
		|ИЗ
		|	Документ.торо_ОценкаРаботыПодрядчика.ОбъектыРемонта КАК торо_ОценкаРаботыПодрядчикаОбъектыРемонта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.торо_ОценкаРаботыПодрядчика.ПараметрыОценки КАК торо_ОценкаРаботыПодрядчикаПараметрыОценки
		|		ПО торо_ОценкаРаботыПодрядчикаОбъектыРемонта.ID = торо_ОценкаРаботыПодрядчикаПараметрыОценки.ID
		|			И торо_ОценкаРаботыПодрядчикаОбъектыРемонта.Ссылка = торо_ОценкаРаботыПодрядчикаПараметрыОценки.Ссылка
		|ГДЕ
		|	торо_ОценкаРаботыПодрядчикаПараметрыОценки.ВидОценки ЕСТЬ NULL 
		|	И торо_ОценкаРаботыПодрядчикаОбъектыРемонта.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ШаблонСообщения = НСтр("es='Para el objeto %1 no son indicados los criterios de la apreciación';ru='Для объекта %1 не указаны критерии оценки';en='Valuation criteria not specified for object%1'");
		
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ОбъектРемонта);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЦикла;
		
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьУправляемыеБлокировки();

	Движения.торо_ОценкиПоПодрядчикам.Записывать          = Истина;
	Движения.торо_ОценкиПодрядчиковПоКритериям.Записывать = Истина;

	Если Не ОценкаДляВсехРабот Тогда
		
		Для Каждого ТекСтрокаОценкиПодрядчиков Из ОценкиПодрядчиков Цикл
			СтрокаОР = ОбъектыРемонта.Найти(ТекСтрокаОценкиПодрядчиков.ID,"ID");
			
			Если СтрокаОР <> Неопределено Тогда
				Движение = Движения.торо_ОценкиПоПодрядчикам.Добавить();
				Движение.Период                 = Дата;
				Движение.Контрагент             = Контрагент;
				Движение.Оценка                 = ТекСтрокаОценкиПодрядчиков.ВидОценки;
				Движение.ОбъектРемонта          = СтрокаОР.ОбъектРемонта;
				Движение.ВидРемонта             = СтрокаОР.ВидРемонта;
				Движение.Значение               = ТекСтрокаОценкиПодрядчиков.Оценка;
				Движение.РемонтыОборудования_ID = ТекСтрокаОценкиПодрядчиков.ID;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекСтрокаОценкиПодрядчиков Из ПараметрыОценки Цикл
			СтрокаОР = ОбъектыРемонта.Найти(ТекСтрокаОценкиПодрядчиков.ID,"ID");
			
			Если СтрокаОР <> Неопределено Тогда
				Движение = Движения.торо_ОценкиПодрядчиковПоКритериям.Добавить();
				Движение.Период                 = Дата;
				Движение.Контрагент             = Контрагент;
				Движение.Оценка                 = ТекСтрокаОценкиПодрядчиков.КритерийОценки;
				Движение.ВидОценки              = ТекСтрокаОценкиПодрядчиков.ВидОценки;
				Движение.ОбъектРемонта          = СтрокаОР.ОбъектРемонта;
				Движение.ВидРемонта             = СтрокаОР.ВидРемонта;
				Движение.Значение               = ТекСтрокаОценкиПодрядчиков.ЗначениеОценокПоКритериям;
				Движение.РемонтыОборудования_ID = ТекСтрокаОценкиПодрядчиков.ID;
			КонецЕсли;
		КонецЦикла;

	Иначе
		
		МассивСтрокДляВсех = ОценкиПодрядчиков.НайтиСтроки(Новый Структура("ID",""));		
		
		Для Каждого СтрокаОР из АктОВыполненииРабот.РемонтыОборудования Цикл
			Для Каждого ТекСтрокаОценкиПодрядчиков Из МассивСтрокДляВсех Цикл
				Движение = Движения.торо_ОценкиПоПодрядчикам.Добавить();
				Движение.Период                 = Дата;
				Движение.Контрагент             = Контрагент;
				Движение.Оценка                 = ТекСтрокаОценкиПодрядчиков.ВидОценки;
				Движение.ОбъектРемонта          = СтрокаОР.ОбъектРемонта;
				Движение.ВидРемонта             = СтрокаОР.ВидРемонтныхРабот;
				Движение.Значение               = ТекСтрокаОценкиПодрядчиков.Оценка;
				Движение.РемонтыОборудования_ID = СтрокаОР.ID;
			КонецЦикла;
		КонецЦикла;
		
		МассивСтрокДляВсех = ПараметрыОценки.НайтиСтроки(Новый Структура("ID",""));		
		
		Для Каждого СтрокаОР из АктОВыполненииРабот.РемонтыОборудования Цикл
			Для Каждого ТекСтрокаОценкиПодрядчиков Из МассивСтрокДляВсех Цикл
				Движение = Движения.торо_ОценкиПодрядчиковПоКритериям.Добавить();
				Движение.Период                 = Дата;
				Движение.Контрагент             = Контрагент;
				Движение.Оценка                 = ТекСтрокаОценкиПодрядчиков.КритерийОценки;
				Движение.ВидОценки              = ТекСтрокаОценкиПодрядчиков.ВидОценки;
				Движение.ОбъектРемонта          = СтрокаОР.ОбъектРемонта;
				Движение.ВидРемонта             = СтрокаОР.ВидРемонтныхРабот;
				Движение.Значение               = ТекСтрокаОценкиПодрядчиков.ЗначениеОценокПоКритериям;
				Движение.РемонтыОборудования_ID = СтрокаОР.ID;
			КонецЦикла;
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьУправляемыеБлокировки()
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("Документ.торо_ОценкаРаботыПодрядчика");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("АктОВыполненииРабот",АктОВыполненииРабот);
	ЭлементБлокировки.УстановитьЗначение("Контрагент",Контрагент);
	
	Блокировка.Заблокировать();
	
КонецПроцедуры

Процедура ПроверкаСуществующихОценок(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("АктОВыполненииРабот", АктОВыполненииРабот);
	Запрос.УстановитьПараметр("Контрагент"         , Контрагент);
	Запрос.УстановитьПараметр("Ссылка"             , Ссылка);
	Запрос.УстановитьПараметр("ТабОценок"          , ОценкиПодрядчиков.Выгрузить());
	
	Если ОценкаДляВсехРабот Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.ID КАК ID
		               |ПОМЕСТИТЬ ВТ_РемонтыОборудования
		               |ИЗ
		               |	Документ.торо_АктОВыполненииЭтапаРабот.РемонтыОборудования КАК торо_АктОВыполненииЭтапаРаботРемонтыОборудования
		               |ГДЕ
		               |	торо_АктОВыполненииЭтапаРаботРемонтыОборудования.Ссылка = &АктОВыполненииРабот
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТабДанных.ВидОценки КАК ВидОценки
		               |ПОМЕСТИТЬ ВТ_Оценки
		               |ИЗ
		               |	&ТабОценок КАК ТабДанных
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ_Оценки.ВидОценки КАК ВидОценки,
		               |	ВТ_РемонтыОборудования.ID КАК ID
		               |ПОМЕСТИТЬ ВТ_Ремонты
		               |ИЗ
		               |	ВТ_Оценки КАК ВТ_Оценки,
		               |	ВТ_РемонтыОборудования КАК ВТ_РемонтыОборудования
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_ОценкиПодрядчиковПоКритериям.Регистратор КАК Регистратор
		               |ИЗ
		               |	РегистрСведений.торо_ОценкиПодрядчиковПоКритериям КАК торо_ОценкиПодрядчиковПоКритериям
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ремонты КАК ВТ_Ремонты
		               |		ПО торо_ОценкиПодрядчиковПоКритериям.РемонтыОборудования_ID = ВТ_Ремонты.ID
		               |			И торо_ОценкиПодрядчиковПоКритериям.ВидОценки = ВТ_Ремонты.ВидОценки
		               |ГДЕ
		               |	торо_ОценкиПодрядчиковПоКритериям.Регистратор.АктОВыполненииРабот = &АктОВыполненииРабот
		               |	И торо_ОценкиПодрядчиковПоКритериям.Контрагент = &Контрагент
		               |	И торо_ОценкиПодрядчиковПоКритериям.Регистратор <> &Ссылка";		
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТабДанных.ID КАК ID,
		               |	ТабДанных.ВидОценки КАК ВидОценки
		               |ПОМЕСТИТЬ ВТ_Ремонты
		               |ИЗ
		               |	&ТабОценок КАК ТабДанных
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	торо_ОценкиПодрядчиковПоКритериям.Регистратор КАК Регистратор
		               |ИЗ
		               |	РегистрСведений.торо_ОценкиПодрядчиковПоКритериям КАК торо_ОценкиПодрядчиковПоКритериям
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Ремонты КАК ВТ_Ремонты
		               |		ПО торо_ОценкиПодрядчиковПоКритериям.ВидОценки = ВТ_Ремонты.ВидОценки
		               |			И торо_ОценкиПодрядчиковПоКритериям.РемонтыОборудования_ID = ВТ_Ремонты.ID
		               |ГДЕ
		               |	торо_ОценкиПодрядчиковПоКритериям.Регистратор.АктОВыполненииРабот = &АктОВыполненииРабот
		               |	И торо_ОценкиПодрядчиковПоКритериям.Контрагент = &Контрагент
		               |	И торо_ОценкиПодрядчиковПоКритериям.Регистратор <> &Ссылка";
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ШаблонСообщения = НСтр("es='Hay ya un documento de la apreciación del trabajo del contratista con el acta dada, el contratante y el tipo de la reparación en el documento ""%1""';ru='Уже существует документ оценки работы подрядчика с заданным актом, контрагентом и видом ремонта в документе ""%1""';en='There is already a document evaluating the performance of the contractor with the specified act, counterparty and type of repair in the document ""%1""'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.Регистратор);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
